Repository: AunAbbas-hack/nova_tasks
Catalog: lib/l10n/app_*.arb
Languages: ur

source: Settings
ur: سیٹنگز

# profileName
source: Andria
ur: انڈریا

source: APPEARANCE
ur: ظاہری شکل

source: Dark Mode
ur: ڈارک موڈ

source: System Default
ur: سسٹم ڈیفالٹ

source: Default Home View
ur: ڈیفالٹ ہوم ویو

source: Today
ur: آج

source: GENERAL
ur: جنرل

source: Default Reminder Time
ur: ڈیفالٹ ریمائنڈر ٹائم

# time0900am
source: 09:00 AM
ur: صبح 09:00

source: Language
ur: زبان

source: English
ur: انگریزی

source: ACCOUNT
ur: اکاؤنٹ

source: Logout
ur: لاگ آؤٹ

source: Urdu
ur: اردو

source: Week
ur: ہفتہ

# tasksCompletedLabel
source: Tasks Completed
ur: مکمل شدہ ٹاسکس

# onTimeRateLabel
source: On-Time Rate
ur: وقت پر مکمل کرنے کی شرح

# currentStreakLabel
source: Current Streak
ur: موجودہ سلسلہ

source: Profile
ur: پروفائل

source: Full Name
ur: پورا نام

source: Email
ur: ای میل

source: Productivity Insights
ur: پروڈکٹیویٹی ان سائٹس

# tasksCompleted
source: {count} Tasks Completed
ur: /{count} مکمل شدہ ٹاسکس

# onTimeRate
source: {percent}% On-Time Rate
ur: {percent}% وقت پر مکمل کرنے کی شرح

# currentStreak
source: {days} Day Streak
ur: {days} دن کا سلسلہ

source: Notifications
ur: نوٹیفیکیشنز

source: Save Changes
ur: تبدیلیاں محفوظ کریں

# notificationsToday
source: Today
ur: آج

source: Clear All
ur: تمام صاف کریں

# noNotificationsTitle
source: You're all caught up!
ur: آپ مکمل طور پر اپ ٹو ڈیٹ ہیں!

# noNotificationsSubtitle
source: No notifications right now
ur: اس وقت کوئی نوٹیفیکیشن نہیں

# notificationsYesterday
source: Yesterday
ur: گزشتہ دن

# notificationDueSoonTitle
source: Task Due Soon
ur: جلد مکمل ہونے والا ٹاسک

# notificationOverdueTitle
source: Overdue Task
ur: وقت گزر جانے والا ٹاسک

# notificationProductivityInsightTitle
source: Productivity Insight
ur: پیداواری کارکردگی

# notificationCollaborationTitle
source: New Tasks
ur: تعاون کی تازہ کاری

# notificationDueSoonMessage
source: {taskTitle}: Due in {relativeTime}
ur: {taskTitle} کو {relativeTime} تک مکمل کرنا ہے

# notificationOverdueMessage
source: {taskTitle}: {relativeTime} ago
ur: {relativeTime} پر {taskTitle}

# notificationProductivityInsightMessage
source: You completed {completedCount} task(s) yesterday!
ur: آپ نے کل {completedCount} ٹاسک مکمل کیے!

# notificationCollaborationMessage
source: {assignerName} assigned you a new task
ur: {assignerName} نے آپ کو نیا ٹاسک دیا ہے

# notificationActivityTitle
source: New tasks
ur: نئی ٹاسکس

# notificationSnoozeButton
source: Snooze
ur: اسنوز

# notificationMarkDoneButton
source: Mark as Done
ur: مکمل کریں

# notificationActivityMessage
source: You created new tasks yesterday.
ur: آپ نے کل نئی ٹاسکس بنائیں۔

source: Mark as Done
ur: مکمل کے طور پر نشان زد کریں

source: Snooze
ur: مؤخر کریں

source: Hi
ur: ہیلو

source: Show All
ur: سب دکھائیں

# filterAll
source: All
ur: تمام

# filterPersonal
source: Personal
ur: ذاتی

# filterWork
source: Work
ur: ٹاسک

# tasksForDay
source: Tasks for {day}, {date}
ur: {day}، {date}

# noTasksForDay
source: No tasks for this day
ur: آج کے لیے کوئی ٹاسک موجود نہیں

# bottomNavHome
source: Home
ur: ہوم

# bottomNavCalendar
source: Calendar
ur: کیلنڈر

# bottomNavMe
source: Me
ur: پروفائل

# dayMon
source: Mon
ur: پیر

# dayTue
source: Tue
ur: منگل

# dayWed
source: Wed
ur: بدھ

# dayThu
source: Thu
ur: جمعرات

# dayFri
source: Fri
ur: جمعہ

# daySat
source: Sat
ur: ہفتہ

# daySun
source: Sun
ur: اتوار

# filterTitleShow
source: Show
ur: دکھائیں

# filterAllTasks
source: All (Today + Overdue + Upcoming)
ur: تمام (آج + زائد المیعاد + آنے والے)

# filterOverdueTasks
source: Overdue Tasks
ur: زائد المیعاد ٹاسک

# filterTodayTasks
source: Today Tasks
ur: آج کے ٹاسک

# filterUpcomingTasks
source: Upcoming Tasks
ur: آنے والے ٹاسک

# filterCancelButton
source: Cancel
ur: منسوخ کریں

# filterApplyButton
source: Apply
ur: لاگو کریں

# noTasksForFilter
source: No tasks found for this filter.
ur: اس فلٹر کے لیے کوئی ٹاسک نہیں ملا۔

# deleteTaskTitle
source: Delete task?
ur: ٹاسک حذف کریں؟

# deleteTaskMessage
source: Are you sure you want to delete this task?
ur: کیا آپ واقعی اس ٹاسک کو حذف کرنا چاہتے ہیں؟

# cancelAction
source: Cancel
ur: منسوخ کریں

# deleteAction
source: Delete
ur: حذف کریں

# editTaskTitle
source: Edit
ur: اپ ڈیٹ کریں

# newTaskTitle
source: New Task
ur: نیا ٹاسک

# saveAction
source: Save
ur: محفوظ کریں

# taskTitleLabel
source: Task Title
ur: ٹاسک کا عنوان

# taskTitleHint
source: e.g., Design the new dashboard
ur: مثال کے طور پر، نیا ڈیش بورڈ ڈیزائن کریں

# taskDescriptionLabel
source: Description
ur: تفصیل

# taskDescriptionHint
source: Add details about the task...
ur: ٹاسک کے بارے میں تفصیلات شامل کریں...

# dueDateLabel
source: Due Date
ur: مقررہ تاریخ

# timeLabel
source: Time
ur: وقت

# priorityLabel
source: Priority
ur: اہمیت

# priorityLow
source: Low
ur: کم

# priorityMedium
source: Medium
ur: درمیانی

# priorityHigh
source: High
ur: ضروری

# priorityUrgent
source: Urgent
ur: انتہائی ضروری

# categoryLabel
source: Category
ur: قسم

# categoryWork
source: Work
ur: ٹاسک

# recurringTaskLabel
source: Recurring Task
ur: دوبارہ ہونے والا ٹاسک

# recurringTaskHint
source: Set task to repeat
ur: ٹاسک کو بار بار ہونے کے لیے سیٹ کریں

# subtasksLabel
source: Subtasks
ur: ذیلی ٹاسک

# subtasksProgressLabel
source: Progress
ur: پیش رفت

# subtasksCompletedStatus
source: {completed} of {total} Completed
ur: {completed} میں سے {total} ذیلی ٹاسک مکمل

# addSubtaskAction
source: Add Subtask
ur: ذیلی ٹاسک شامل کریں

# createTaskAction
source: Create Task
ur: ٹاسک بنائیں

source: Enter custom category
ur: حسبِ ضرورت قسم درج کریں

# categoryPersonal
source: Personal
ur: ذاتی

# categoryCustom
source: Custom
ur: حسبِ ضرورت

source: Updating...
ur: اپ ڈیٹ کیا جا رہا ہے...

source: Creating...
ur: بنا یا جا رہا ہے...

# updateTaskAction
source: Update Task
ur: ٹاسک اپ ڈیٹ کریں

# loginRequiredToAddTask
source: You must be logged in to add tasks
ur: ٹاسک شامل کرنے کے لیے لاگ ان ہونا ضروری ہے

source: Task Created
ur: ٹاسک تخلیق ہوگیا

source: Task Updated
ur: ٹاسک اپڈیٹ ہوگیا

source: No subtasks added.
ur: کوئی ذیلی ٹاسک شامل نہیں کیا گیا۔

source: No description added.
ur: کوئی وضاحت شامل نہیں کی گئی۔

source: Task Details
ur: ٹاسک کی تفصیلات

source: January
ur: جنوری

source: February
ur: فروری

source: March
ur: مارچ

source: April
ur: اپریل

source: May
ur: مئی

source: June
ur: جون

source: July
ur: جولائی

source: August
ur: اگست

source: September
ur: ستمبر

source: October
ur: اکتوبر

source: November
ur: نومبر

source: December
ur: دسمبر

source: Tasks from
ur: ٹاسک سے

source: Tasks for
ur: ٹاسک

source: task(s) in this range
ur: اس حد میں ٹاسک

source: task(s) for this day
ur: اس دن کے لیے ٹاسک

source: No tasks...
ur: کوئی ٹاسک نہیں...

source: Month
ur: مہینہ
